# SQL Basics

**Connecting to our Database**

In [ ]:
# We will first load an sql extension into our environment
# This extension will allow us to work with sql on Colaboratory
#
%load_ext sql

# We will then connect to our in memory sqlite database
# NB: This database will cease to exist as soon as the database connection is closed.
# We will learn more about how databases are created later in prep.
#
%sql sqlite://

**CRUD operations**

Earlier on we briefly talked about the basic operations when it comes database programming. 

Now we are going to practically explore these operations.

Just as a recap, these operations are:

**C**REATE - Insert row/rows in a table

**R**EAD - Read row/rows in a table

**U**PDATE - Edit row/rows in a table

**D**ELETE - Delete row/ rows in a table


Now let's look at each one of them individually

## **CREATE**

First we need to create a table to be able to perform the crud operations.

So Let's create an empty table first

In [ ]:
# we'll create a table that has 3 columns,
# The first column will have country names,
# The second column will have continent of the countries
# Finally, the 3rd column will contain the population of the countries
%%sql

CREATE TABLE countries(
    Name varchar(255),
    Continent varchar(255),
    Population int
);

**INSERT Command**

The command associated with the create operation is the INSERT INTO command. 

If we want to add rows to our new table we are going to use the INSERT INTO command.

It starts with the `INSERT INTO` keyword then we specify the name of the table that we want add rows to. After that we list the column names inside brackets. Lastly, we add the `VALUES` keyword and specify the values  we want the columns to have. 

Let's add few rows in the table we created above

In [ ]:
# Add 5 columns to countries table

%%sql
INSERT INTO countries 
(Name, Continent, Population)
VALUES 
('China','Asia',1433783686),
('Nigeria','Africa',200963599),
('Kenya','Africa',52573973),
('Brazil','North America',211049527),
('Russia','Europe',145872256);

--Note: The values for the column should coincide with the way you have arranged your columns.
--Also, you should be of the same data type as your columns.
--For example, we cannot add and character string in the Population column since we specified that the column should hold integers only.
--Don't worry about viewing the rows we just inserted just yet, we'll do that in the next segment

### **Challenges**

In [ ]:
# Create a table that consists your class members. 
# The table should consist of the following columns:
# First and last names
# Email address
# Phone Number
# Number of siblings
# Level of Education
# ------------------------
# Remember to add the relavant data types for each column
# Once you have done that, populate the table with your classmates details

Your code goes here

## **READ**

The Read operation is used to retrieve data from a table.

The command we use to achieve this is the `SELECT` command 

This command is has three parts:


*   **Column Part**:
Here, we apecify the columns that we want to retrieve the data from. We can choose more than 1 column. If you decide to choose more that one column then you have to separate the column names with a comma
*   **Table Part**: 
We put the name of the table from which we get the data from
*   **Filter Part**:
Though this part is mandatory, it allows us to filter the data that we want to view. So essentially the SELECT command can run without this part. We will see how to make use of this part later on.

**Note**: If we want to retrieve data from more than one table we can use the `JOIN` operator. This operator is very important for you as a data scientist. We'll look at it in-depth later on.

In [ ]:
# We'll start off by reading all the columns in a table.
# To this end we'll read from the table we just created and populated in above
# To read all the columns in a table, we'll mke use of the asterisk (*) operator.

%%sql

SELECT * FROM countries;

In [ ]:
# Now that we have seen how that works, let's retieve data from  specific  columns
# -- When you want to write comments in SQL, we use two dashes (--)
# -- NOTE: When retrieving data from specific columns, make sure the column name you write in the select command matches the actual column name in your table.
%%sql

-- Retrieving data from Name and Population columns

SELECT Name, Population FROM countries;

**Using ALIASES in SELECT statements**

Aliases are temporary names that we give tables or columns in the SELECT statements.

There are a number of reason we would opt to use aliases. These reasons can be one of the following:


*   Make the query more readable if the table or column names are complex.
*   If a table is using a query more than one time.

*   It can reduce the query writing effort if the table or column name is long.

In [ ]:
# Let's rewrite the our previous two queries with table and column aliases
#  In the following query, cntry alias wil specify the table name
%%sql
SELECT cntry.Name FROM countries as cntry;

In [ ]:
# In this example, we provide aliases for the column names.
# 
%%sql

SELECT name as CName, population as Cpop FROM countries

### Challenges

In [ ]:
# Retrieve data for your class members table that you created earlier
Your code goes here

In [ ]:
# Create ALIASES for both the table and columns of your class members table

Your code goes here

**Sorting SELECT statements results**

The `ORDER BY` clause allows us to sort results of the SELECT statement according to a specified column or columns

Additionally, we can perform ascending ir descending sorting thanks to the `ORDER BY` clause

Let's see how this works

In [ ]:
# Let's sort our countries table according to the population of the countries in ascending order
%%sql

SELECT * FROM countries as Cntry
ORDER BY  Cntry.population ASC

### Challenges

In [ ]:
# Sort the names of your class members according to the number of siblings

**Filtering SELECT statements**

When retrieving dat from a table, w can decide to filter the results through the `WHERE` clause

In [ ]:
# Let's retrieve data from the our table according to country Name but only return the data of Kenya

%%sql
SELECT * FROM countries 
WHERE Name = 'Kenya'

## **UPDATE**

The UPDATE statement is modify existing data in a table

It must include a SET clause so that we can define the target column in which we want to modify

Let's see this in action

In [ ]:
# Let's change all of the rows in the population columnn to 1

%%sql

UPDATE countries SET population = 1;

SELECT * from countries

In the UPDATE statements, we can use the WHERE clause so that we can modify particular row or rows in the table.

In [ ]:
# Let's change the kenyan population to 245000
%%sql

UPDATE countries SET population = 245000
WHERE Name = 'Kenya';

SELECT * FROM countries

## **DELETE**

The Delete statement is used to remove existing row/rows in the table. At first, we will mention how to use the `WHERE` clause in the `DELETE` statements, just because most of the time we want to filter the deleted rows

In [ ]:
%%sql
DELETE FROM countries WHERE Name = 'Russia';

SELECT * From countries

### Challenges

In [ ]:
# Create a table called artists, choose the columns names of your choosing. Populate it with data
# Your task is to delete an aritst's name whose name contain the letter s

# Hint: you use this resource to see how to do the above task.https://www.sqlitetutorial.net/sqlite-delete/

In [ ]:
# Delete all the rows in your artist table